In [1]:
pip install numpy

Requirement already satisfied: numpy in /Users/elmojuanara/opt/anaconda3/lib/python3.9/site-packages (1.21.5)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
list1 = ['q','w','e','r','t','y']

In [6]:
series1 = pd.Series(list1)

In [9]:
print(series1)

0    q
1    w
2    e
3    r
4    t
5    y
dtype: object

In [10]:
array1 = np.array(['a','b','c','d','e','f'])

In [12]:
series2 = pd.Series(array1)

In [13]:
print(series2)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [15]:
country_population = pd.Series([1367.6,1411.78,328.46,37.53], index = ['India','China','United States','Canada'])

In [16]:
print(country_population)

India            1367.60
China            1411.78
United States     328.46
Canada             37.53
dtype: float64

In [17]:
country_population[0]

1367.6

In [18]:
country_population[0:3]

India            1367.60
China            1411.78
United States     328.46
dtype: float64

In [19]:
country_population.loc['Canada']

37.53

In [20]:
country_population.iloc[2]

328.46

In [21]:
vector_series1 = pd.Series([10,20,30,40], index=['a','b','c','d'])
vector_series2 = pd.Series([40,30,20,10], index=['a','b','c','d'])

In [23]:
vector_series1.add(vector_series2)

a    50
b    50
c    50
d    50
dtype: int64

In [24]:
vector_series1 = pd.Series([10,20,30,40], index=['a','b','c','d'])
vector_series2 = pd.Series([40,30,20,10], index=['a','c','b','d'])

In [25]:
vector_series1.add(vector_series2)

a    50
b    40
c    60
d    50
dtype: int64

In [26]:
vector_series1 = pd.Series([10,20,30,40], index=['a','b','c','d'])
vector_series2 = pd.Series([40,30,20,10], index=['a','c','d','e'])

In [29]:
vector_series1.add(vector_series2)

a    50.0
b     NaN
c    60.0
d    60.0
e     NaN
dtype: float64

In [30]:
vector_series1.add(vector_series2, fill_value=0)

a    50.0
b    20.0
c    60.0
d    60.0
e    10.0
dtype: float64

In [31]:
data = {'Name':['Jack','Jill','Harry','Vin','Jake'],'Age':[10,11,12,13,14]}

In [33]:
list_df1 = pd.DataFrame(data)

In [34]:
list_df1

    Name  Age
0   Jack   10
1   Jill   11
2  Harry   12
3    Vin   13
4   Jake   14

In [40]:
dob = ['2011-05-03','2012-04-02','2013-09-01','2014-01-12','2015-02-03']

In [41]:
list_df1['DOB']=dob

In [42]:
list_df1

    Name  Age         DOB
0   Jack   10  2011-05-03
1   Jill   11  2012-04-02
2  Harry   12  2013-09-01
3    Vin   13  2014-01-12
4   Jake   14  2015-02-03

In [43]:
list_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   DOB     5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [44]:
list_df1['DOB'] = pd.to_datetime(list_df1['DOB'])

In [45]:
list_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   DOB     5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 248.0+ bytes

In [46]:
country_population = pd.Series([1367.6,1411.78,328.46,37.53], index = ['India','China','United States','Canada'])
country_area = pd.Series([3.287,9.597,9.834,9.985], index = ['India','China','United States','Canada'])

In [48]:
country_df = pd.DataFrame({'Population in Millions':country_population, 'area in million km sq':country_area})

In [49]:
country_df

               Population in Millions  area in million km sq
India                         1367.60                  3.287
China                         1411.78                  9.597
United States                  328.46                  9.834
Canada                          37.53                  9.985

In [50]:
country_df.max()

Population in Millions    1411.780
area in million km sq        9.985
dtype: float64

In [51]:
country_df.min()

Population in Millions    37.530
area in million km sq      3.287
dtype: float64

In [53]:
country_df.mean()

Population in Millions    786.34250
area in million km sq       8.17575
dtype: float64

In [55]:
country_df.std()

Population in Millions    706.967442
area in million km sq       3.263077
dtype: float64